xingbiground/TC375_MCAL/0_Src/McIsar/Src/Infra_Prod/Sfr/TC37xA/_Reg/IfxMinimcds_bf.h
/** \brief Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.SUS */
#define IFX_MINIMCDS_TCX_DCSTS_SUS_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.IDLE */
#define IFX_MINIMCDS_TCX_DCSTS_IDLE_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.IDLE */
#define IFX_MINIMCDS_TCX_DCSTS_IDLE_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.IDLE */
#define IFX_MINIMCDS_TCX_DCSTS_IDLE_OFF (1u)

/** \brief Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.HALT */
#define IFX_MINIMCDS_TCX_DCSTS_HALT_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.HALT */
#define IFX_MINIMCDS_TCX_DCSTS_HALT_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.HALT */
#define IFX_MINIMCDS_TCX_DCSTS_HALT_OFF (2u)

/** \brief Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.ISR */
#define IFX_MINIMCDS_TCX_DCSTS_ISR_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.ISR */
#define IFX_MINIMCDS_TCX_DCSTS_ISR_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.ISR */
#define IFX_MINIMCDS_TCX_DCSTS_ISR_OFF (3u)

/** \brief Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.HBRK */
#define IFX_MINIMCDS_TCX_DCSTS_HBRK_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.HBRK */
#define IFX_MINIMCDS_TCX_DCSTS_HBRK_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.HBRK */
#define IFX_MINIMCDS_TCX_DCSTS_HBRK_OFF (4u)

/** \brief Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.SBRK */
#define IFX_MINIMCDS_TCX_DCSTS_SBRK_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.SBRK */
#define IFX_MINIMCDS_TCX_DCSTS_SBRK_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.SBRK */
#define IFX_MINIMCDS_TCX_DCSTS_SBRK_OFF (5u)

/** \brief Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.IEN */
#define IFX_MINIMCDS_TCX_DCSTS_IEN_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.IEN */
#define IFX_MINIMCDS_TCX_DCSTS_IEN_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.IEN */
#define IFX_MINIMCDS_TCX_DCSTS_IEN_OFF (7u)

/** \brief Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.DBGEN */
#define IFX_MINIMCDS_TCX_DCSTS_DBGEN_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.DBGEN */
#define IFX_MINIMCDS_TCX_DCSTS_DBGEN_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.DBGEN */
#define IFX_MINIMCDS_TCX_DCSTS_DBGEN_OFF (8u)

/** \brief Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.CLKDIV */
#define IFX_MINIMCDS_TCX_DCSTS_CLKDIV_LEN (2u)

/** \brief Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.CLKDIV */
#define IFX_MINIMCDS_TCX_DCSTS_CLKDIV_MSK (0x3u)

/** \brief Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.CLKDIV */
#define IFX_MINIMCDS_TCX_DCSTS_CLKDIV_OFF (9u)

/** \brief Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.NESTED_ISR */
#define IFX_MINIMCDS_TCX_DCSTS_NESTED_ISR_LEN (4u)

/** \brief Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.NESTED_ISR */
#define IFX_MINIMCDS_TCX_DCSTS_NESTED_ISR_MSK (0xfu)

/** \brief Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.NESTED_ISR */
#define IFX_MINIMCDS_TCX_DCSTS_NESTED_ISR_OFF (11u)

/** \brief Length for Ifx_MINIMCDS_TCX_CIP_Bits.CURRENT */
#define IFX_MINIMCDS_TCX_CIP_CURRENT_LEN (31u)

/** \brief Mask for Ifx_MINIMCDS_TCX_CIP_Bits.CURRENT */
#define IFX_MINIMCDS_TCX_CIP_CURRENT_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MINIMCDS_TCX_CIP_Bits.CURRENT */
#define IFX_MINIMCDS_TCX_CIP_CURRENT_OFF (1u)

/** \brief Length for Ifx_MINIMCDS_TCX_CFT_Bits.VSHRT_FCT */
#define IFX_MINIMCDS_TCX_CFT_VSHRT_FCT_LEN (10u)

/** \brief Mask for Ifx_MINIMCDS_TCX_CFT_Bits.VSHRT_FCT */
#define IFX_MINIMCDS_TCX_CFT_VSHRT_FCT_MSK (0x3ffu)

/** \brief Offset for Ifx_MINIMCDS_TCX_CFT_Bits.VSHRT_FCT */
#define IFX_MINIMCDS_TCX_CFT_VSHRT_FCT_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_TCX_CFT_Bits.SHRT_FCT */
#define IFX_MINIMCDS_TCX_CFT_SHRT_FCT_LEN (10u)

/** \brief Mask for Ifx_MINIMCDS_TCX_CFT_Bits.SHRT_FCT */
#define IFX_MINIMCDS_TCX_CFT_SHRT_FCT_MSK (0x3ffu)

/** \brief Offset for Ifx_MINIMCDS_TCX_CFT_Bits.SHRT_FCT */
#define IFX_MINIMCDS_TCX_CFT_SHRT_FCT_OFF (16u)

/** \brief Length for Ifx_MINIMCDS_TCX_EA_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCX_EA_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MINIMCDS_TCX_EA_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCX_EA_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MINIMCDS_TCX_EA_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCX_EA_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_TCX_EA_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCX_EA_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MINIMCDS_TCX_EA_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCX_EA_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MINIMCDS_TCX_EA_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCX_EA_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_TCX_WD_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCX_WD_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MINIMCDS_TCX_WD_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCX_WD_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MINIMCDS_TCX_WD_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCX_WD_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_TCX_WD_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCX_WD_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MINIMCDS_TCX_WD_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCX_WD_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MINIMCDS_TCX_WD_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCX_WD_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_TCX_WD_MSK_Bits.MASK */
#define IFX_MINIMCDS_TCX_WD_MSK_MASK_LEN (32u)

/** \brief Mask for Ifx_MINIMCDS_TCX_WD_MSK_Bits.MASK */
#define IFX_MINIMCDS_TCX_WD_MSK_MASK_MSK (0xffffffffu)

/** \brief Offset for Ifx_MINIMCDS_TCX_WD_MSK_Bits.MASK */
#define IFX_MINIMCDS_TCX_WD_MSK_MASK_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_TCX_WD_SGN_Bits.SIGN */
#define IFX_MINIMCDS_TCX_WD_SGN_SIGN_LEN (5u)

/** \brief Mask for Ifx_MINIMCDS_TCX_WD_SGN_Bits.SIGN */
#define IFX_MINIMCDS_TCX_WD_SGN_SIGN_MSK (0x1fu)

/** \brief Offset for Ifx_MINIMCDS_TCX_WD_SGN_Bits.SIGN */
#define IFX_MINIMCDS_TCX_WD_SGN_SIGN_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_TCX_AC_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCX_AC_BND_BOUND_LEN (14u)

/** \brief Mask for Ifx_MINIMCDS_TCX_AC_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCX_AC_BND_BOUND_MSK (0x3fffu)

/** \brief Offset for Ifx_MINIMCDS_TCX_AC_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCX_AC_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_TCX_AC_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCX_AC_RNG_RANGE_LEN (14u)

